// Blog posts data (single declaration)
export const blogs = [
  {
    image: "images/blog/framework.webp",
    date: "4 June 2021",
    title: "কোন Language/Framework /Database শিখব?",
    description:
      "মাঝে মাঝে জুনিয়ররা জিজ্ঞেস করে কোন Language/Framework /Database শিখব। Technology এ বিষয়গুলো প্রতি নিয়ত পরিবর্তনশীল। তাই চট করে এর উত্তর দেওয়া যায় না। কোন বিষয় গুলো বর্তমানে ট্রেন্ডিং এ আছে, একটু সার্চ করলেই পাওয়া যায়। stackoverflow প্রতিবছর এটা নিয়ে survey করে। একটা উদাহরণ দিয়ে বলি, javascript(JS) এর কথা। ২০০৯ সালের আগে পর্যন্ত javascript শুধুমাত্র ক্লায়েন্ট সাইডে ব্যবহার করা যেত এবং মানুষ সেকেন্ডারি হিসেবে JS শিখত। কিন্তু ২০০৯ সালে Node আশার পর এই ইন্ডাস্ট্রি exponentially growth পায়। বর্তমানে এটি প্রায় ১ ট্রিলিওন ডলারের মার্কেট।",
    tags: ["Nodejs", "Framework", "Database"],
  },
  {
    image: "images/blog/why-psychology.webp",
    date: "5 July 2021",
    title: "বুদ্ধিমান গাধা বা গাধা বুদ্ধিমান?",
    description:
      "চুপচাপ থাকা মানুষ সাধারনত ২ ধরনের হয়। হয় গাধা, না হয় বুদ্ধিমান। তাই  মানুষের এদেরকে নিয়ে বেশি কৌতূহল থাকে। এই কৌতূহল ততক্ষণ পর্যন্ত থাকে, যতক্ষণ না সে তার উচ্চারিত বাক্য দিয়ে তার জ্ঞানের পরিচয় দেয়।",
    tags: ["Pshycology"],
  },
  {
    image: "images/blog/income.webp",
    date: "4 Jan 2025",
    title: "কিভাবে আয় শুরু করবেন 2025 সালে?",
    description:
      "কম্পিউটার সায়েন্সের শিক্ষার্থীরা ২০২৫ সালে আয় শুরু করতে পারেন বিভিন্ন উপায়ে। স্কিল যেমন: ওয়েব ডেভেলপমেন্ট, অ্যাপ ডেভেলপমেন্ট, গ্রাফিক ডিজাইন, কিংবা কন্টেন্ট রাইটিং শিখে ফ্রিল্যান্সিং শুরু করা যায় Fiverr, Upwork, বা Freelancer-এর মাধ্যমে। এছাড়া ছোট প্রজেক্ট তৈরি করে GitHub-এ শেয়ার করলে চাকরির সুযোগ বাড়ে। YouTube, Facebook Page বা নিজের ব্লগ চালিয়েও আয় করা সম্ভব। প্রাইভেট টিউশনি, কোডিং পড়ানো বা কোর্স বানিয়েও আয় করা যায়। ডাটা এন্ট্রি বা ভার্চুয়াল অ্যাসিস্ট্যান্টের মতো রিমোট জব করেও আয় করা যায়। নিয়মিত স্কিল বাড়ানো, অনুশীলন করা এবং সময় ঠিকভাবে ব্যবস্থাপনা করলেই সফলতা আসবে ইনশাআল্লাহ।",
    tags: ["Javascript"],
  },
];
